[
  {
    "title": "What is Infertility?",
    "subtitle": "Understanding your diagnosis",
    "systemIcon": "person.2.slash",
    "description": "If you've been trying to conceive for 12 months without success (or 6 months if you're over 35), you may be experiencing infertility. This affects about 1 in 6 couples in Canada. Remember, infertility is a medical condition, not a personal failure. Many treatment options are available to help you build your family.",
    "keyPoints": [
      "Affects both men and women, or both partners",
      "Sometimes no cause is found (unexplained infertility)",
      "Age, lifestyle, and medical conditions can all play a role",
      "Early diagnosis improves treatment success"
    ],
    "references": [
      {
        "title": "Infertility FAQ - CDC",
        "url": "https://www.cdc.gov/reproductive-health/infertility-faq/index.html"
      },
      {
        "title": "Fertility Information - PregnancyInfo.ca",
        "url": "https://www.pregnancyinfo.ca/"
      },
      {
        "title": "Fertility Matters Canada",
        "url": "https://www.fertilitymatters.ca/"
      }
    ]
  },
  {
    "title": "Common Causes of Infertility",
    "subtitle": "Why conception may be challenging",
    "systemIcon": "magnifyingglass.circle",
    "description": "Understanding the cause of infertility helps determine the best treatment path. Your fertility specialist will perform tests to identify any issues. Remember, many causes are treatable, and even 'unexplained' infertility can often be overcome with the right approach.",
    "keyPoints": [
      "Female factors: Problems with ovulation, blocked fallopian tubes, endometriosis, or egg quality",
      "Male factors: Low sperm count, poor sperm movement, or sperm shape issues",
      "Age-related: Egg quality and quantity naturally decline with age",
      "Lifestyle factors: Weight, smoking, alcohol, and stress can impact fertility"
    ],
    "references": [
      {
        "title": "Defining Infertility - ASRM Patient Education",
        "url": "https://www.reproductivefacts.org/news-and-publications/fact-sheets-and-infographics/defining-infertility/"
      },
      {
        "title": "CDC Infertility Information",
        "url": "https://www.cdc.gov/reproductive-health/infertility-faq/index.html"
      }
    ]
  },
  {
    "title": "How is Infertility Treated?",
    "subtitle": "Treatment approaches and options",
    "systemIcon": "heart.text.square",
    "description": "Infertility treatment depends on the cause, your age, how long you've been infertile, and personal preferences. Modern medicine offers many effective treatments, from simple interventions to advanced reproductive technologies. Your fertility specialist will work with you to find the best approach for your situation.",
    "keyPoints": [
      "Lifestyle modifications: Weight management, stress reduction, and avoiding tobacco and excessive alcohol can improve fertility",
      "Medications: Fertility drugs like Clomid or Letrozole stimulate ovulation; hormones can improve sperm production",
      "Intrauterine Insemination (IUI): Placing specially prepared sperm directly into the uterus during ovulation",
      "In Vitro Fertilization (IVF): Combining eggs and sperm in a laboratory, then transferring embryos to the uterus",
      "Intracytoplasmic Sperm Injection (ICSI): Injecting a single sperm directly into an egg during IVF",
      "Third-party reproduction: Using donor eggs, sperm, or embryos, or working with a gestational carrier",
      "Surgery: Correcting anatomical problems like blocked fallopian tubes, endometriosis, or varicoceles"
    ],
    "references": [
      {
        "title": "ASRM - Infertility Treatment Overview",
        "url": "https://www.asrm.org/topics/topics-index/infertility/"
      },
      {
        "title": "CDC - Infertility Treatment FAQs",
        "url": "https://www.cdc.gov/reproductivehealth/infertility/"
      },
      {
        "title": "CFAS - Treatment Options",
        "url": "https://cfas.ca/patient-resources.html"
      }
    ]
  },
  {
    "title": "What is Fertility Preservation?",
    "subtitle": "Protecting future fertility",
    "systemIcon": "snowflake",
    "description": "Fertility preservation allows you to save eggs, sperm, or embryos for future use. This gives you more control over your reproductive timeline and can protect fertility before medical treatments that might affect it.",
    "keyPoints": [
      "Egg freezing: Preserving unfertilized eggs for later use",
      "Sperm freezing: Simple process with excellent success rates",
      "Embryo freezing: Freezing fertilized embryos for future pregnancies",
      "Medical reasons: Before cancer treatment, surgery, or gender transition",
      "Personal choice: Delaying parenthood for career, education, or finding the right partner"
    ],
    "references": [
      {
        "title": "ASRM Fertility Preservation Guide",
        "url": "https://www.reproductivefacts.org/news-and-publications/fact-sheets-and-infographics/"
      },
      {
        "title": "Fertile Future - Cancer & Fertility",
        "url": "https://fertilefuture.ca/"
      },
      {
        "title": "CFAS Patient Resources - Fertility Preservation",
        "url": "https://cfas.ca/patient-resources.html"
      }
    ]
  },
  {
    "title": "Emotional Support & Resources",
    "subtitle": "You're not alone",
    "systemIcon": "heart.circle",
    "description": "Dealing with infertility can be emotionally challenging. It's normal to feel a range of emotions including sadness, anger, and anxiety. Support is available to help you through this journey.",
    "keyPoints": [
      "Counseling: Many clinics offer fertility counseling services",
      "Support groups: Connect with others who understand your experience",
      "Online communities: Find support and information 24/7",
      "Mind-body programs: Yoga, meditation, and acupuncture may help",
      "Communication: Keep talking with your partner and support network"
    ],
    "references": [
      {
        "title": "Fertility Matters Canada - Support Groups",
        "url": "https://www.fertilitymatters.ca/"
      },
      {
        "title": "Infertility and Mental Health Resources",
        "url": "https://www.psychiatry.org/news-room/apa-blogs/infertility-the-impact-of-stress-and-mental-health"
      }
    ]
  },
  {
    "title": "Financial Considerations",
    "subtitle": "Understanding costs and coverage",
    "systemIcon": "dollarsign.circle",
    "description": "Fertility treatments can be expensive, but there are various funding options available. Some provinces offer coverage, and many employers provide fertility benefits. Planning ahead can help reduce financial stress.",
    "keyPoints": [
      "Provincial coverage: Ontario, Quebec, and some other provinces offer partial IVF funding",
      "Insurance: Check your extended health benefits for fertility coverage",
      "Tax credits: Medical expenses including fertility treatments may be tax deductible",
      "Payment plans: Many clinics offer financing options",
      "Grants: Some organizations offer fertility treatment grants"
    ],
    "references": [
      {
        "title": "Financial Support for Fertility Treatment - Government of Canada",
        "url": "https://www.canada.ca/en/public-health/services/sexual-health/financial-support-fertility-treatment-surrogacy.html"
      },
      {
        "title": "Ontario Fertility Treatment Program",
        "url": "https://www.ontario.ca/page/get-fertility-treatments"
      },
      {
        "title": "Fertile Future - Financial Assistance",
        "url": "https://fertilefuture.ca/programs/power-of-hope/"
      }
    ]
  }
]
